//！12-26-2023开始数据结构的学习
//目前学主要是为了应付期末考试的链表，29号考完就需要去准备大英和高数了，有点不舍但是寒假再见吧

目录：
    {
        1.学习路线的分析
    }

1.学习路线的分析
{
    //~ 目前c语言初阶和进阶大致完成，敲了大概78千行代码，基础打的应该还凑合
    //~ 然后去学初阶的数据结构，时间空间复杂度，顺序表链表，栈与队列，二叉树，排序
    //~ 学完之后去学c++
    //~ 然后用c++去实现高阶数据结构，并且开始学习算法
    //~ 同时并行学习Linux操作系统-计算机网络-数据库巴拉巴拉那些东西
}

2.时间与空间复杂度
{
    //@ 前言
    //~ 摩尔定律：集成电路上可以容纳的晶体管数目大约每经过18个月到24个月便会增加一倍。 
    //戈登·摩尔 Intel创始人之一
    //简言之大概18个月硬件内存可以翻一倍。
    //在目前的计算机上已经不太需要考虑空间复杂度，而对时间上运算更快还是有追求的
    //因此我们现在主要考虑的是时间复杂度。

    //@ 2.1时间复杂度的概念
    {
        //~ 由于在不同的机器上，根据cpu能力的大小，同一个程序在不同的环境上跑的时间是不同的，所有时间复杂度并不是单一以运行时间的来衡量。

        //~ 由于一个算法所花费的时间与其中语句的执行次数成正比，算法中的基本操作的执行次数，为算法的时间复杂度。
    }
}


3.顺序表与链表
{
    // @ 3.1线性表
    {
        //~定义：
        //线性表是n个具有相同特征的数据元素的有限序列。线性表是一种在实际中广泛使用的数据结构，常见的线性表：顺序表，链表，栈，队列，字符串...
    }

    // @ 3.2顺序表
    {
        //~ 概念理解：
        //顺序表就可以理解为数组，但是呢，要求顺序表中的数据元素存储必须是从头紧密连接的不能空，不像数组，你想往那里放就往那里放
    }

    // @ 链表
    {
        // ~3.3.1 链表概念
        // 链表是一种物理存储结构上非连续，非顺序的存储结构，数据元素的逻辑顺序是通过链表中的指针链接次序实现的。

    }

}